quest_system_1101639507_name=^?^Petrified Village
quest_system_1101639507_stage_0=^?^Find the Druid Corban, and tell him about the trouble in the village.
quest_system_1101639507_stage_1=^?^Take the amulet from the boy.
quest_system_1101639507_stage_2=^?^Return the amulet to the druid.
quest_system_1101639507_task=^?^For some reason the dwellers of the Verlon village have turned to stone. The only one remaining, a shepherd-boy, has asked you for help. Find the Druid Corban, who lives in the Verlon Forest, and tell him of this trouble.
